<template>
    <div style="margin-bottom: 10%">
        <img class="image" :src="require('@/assets/culture.jpg')">
        <div v-html="text"></div>
    </div>
</template>

<script>
export default {
    name: 'CultureCom',
    data() {
        return {
            text: `
            常熟理工学院的校训“立本求真，日新致远”两句八字，是一个有机的整体。 校训英文翻译：Breed integrity, seek truth—— keep at it and every day will record your progress.（译者：宗福常）<br>

“立本”语出《中庸》“立天下之大本，知天地之化育”和《论语》“君子务本，本立而道生”。《中庸》把正心、明礼、克己、助人、互爱、同乐等一系列道德规范视作天下大本，是为人处世必须具备的条件。《论语》强调要致力于树立根本，根本确立了，原则、措施、方法等自然就有了。学校以育人为本，培养德智体美全面发展的高素质人才，是学校的根本任务；师生以做人为本，做一个高尚的人，纯粹的人，大写的人，是生活的首要目标；学校集体和师生个人都要注意立足之本，奠定和巩固持续生存、发展的基础，以期长盛不衰，大有作为。<br>

“求真”，语出陶行知“千教万教教人求真，千学万学学做真人”。真，客观的情况、状态，事物的本质、规律；真诚，是对人来说最重要的品格（《马克思的自白》）。求真，就是要认识世界，探索规律，崇尚科学，坚持真理，追求真、善、美。<br>

立本与求真是相辅相成的。立本是求真的归宿，求真为了立本；求真是立本的径由，求真才能立本；同时，也只有注重立本，方可更好地求真。“本真”还是中国古代和西方现代对于一种理想境界、理想生存状态和理想人格的概括。<br>

“日新”，语出《大学》“汤之盘铭曰：苟日新，日日新，又日新”。意思是如果某一天能洗涤旧染的污垢而自新，那么在此之后，应该天天洗濯，不断自新。创新是中华民族兴旺发达的不竭动力，是人类社会进步的源泉，是时代要求，世界潮流；创新也是我校近50年自强不息的办学特点。我们要继承和弘扬“日新”精神。<br>

“致远”，语出《论语》“士不可以不弘毅，任重而道远。仁以为己任，不亦重乎？死而后已，不亦远乎？”和“虽小道，必有可观者焉，致远恐泥，是以君子不为也。”儒家强调人要有远大抱负和刚强毅力，为实现理想而奋斗，矢志不渝，坚韧不拔。一个单位、一所学校同样要“志远”，并能“致远”。<br>

“不积跬步，无以致千里”，日新是致远的条件，否则便是好高骛远，而致远又是日新的内在动力，日新致远是高度统一的，给人一种高远的境界和不息追求的意味。<br>

本、真、新、远体现着蓬勃发展中的常熟理工学院的精神风貌和文化精神。“立本求真”和“日新致远”有着内在的联系，构成了有机的整体，它昭示着我们：奠定坚实基础，树立远大目标，不懈求索，不断创新，始终强基固本，永葆生机活力，在开拓进取中持之以恒、臻于完美。<br>

“立本求真，日新致远”的校训，继承了我国传统文化的精华，蕴含着我校办学历史的特点，又体现了当前和未来时代对高等教育的要求，它定将激励和鞭策全院师生员工凝心聚力，建功立业，定将在今后办学过程中产生深远影响。
            `
        };
    },
};
</script>

<style scoped>
.image {
    width: 100%;
    height: auto;
}
</style>